[
    { 
        "id": 1, 
        "name": "Hazmob FPS",
        "category": "Shooter",
        "thumbnail": "https://img.gamedistribution.com/623baec23d504c83acab0b5250859ba8-512x512.jpg", 
        "url": "https://html5.gamedistribution.com/623baec23d504c83acab0b5250859ba8/?gd_sdk_referrer_url=https://www.example.com/games/{game-path}&ar=16:9&fs=1", 
        "use": "iframe",
        "description": "一款刺激的第一人称射击游戏",
        "instructions": "使用WASD移动，鼠标瞄准射击，消灭所有敌人！"
    },
    { 
        "id": 2, 
        "name": "Snow Rider 3D",
        "category": "Racing",
        "thumbnail": "https://img.gamedistribution.com/d6ce0e8e5b8e4c8f9a2b3c4d5e6f7a8b-512x512.jpg", 
        "url": "https://html5.gamedistribution.com/d6ce0e8e5b8e4c8f9a2b3c4d5e6f7a8b/", 
        "use": "iframe",
        "description": "在雪山上驾驶雪橇的3D竞速游戏",
        "instructions": "使用方向键或WASD控制雪橇，避开障碍物，收集金币！"
    },


    { 
        "id": 52, 
        "name": "Max Crusher: Crazy Destruction and Car Crashes",
        "category": "Racing & Driving",
        "thumbnail": "https://img.gamedistribution.com/5e41c93bc2284e158cc5faa719aba03b-512x512.jpg", 
        "url": "https://html5.gamedistribution.com/5e41c93bc2284e158cc5faa719aba03b/?gd_sdk_referrer_url=https://www.example.com/games/{game-path}&ar=16:9&fs=1", 
        "use": "redirect",
        "description":"Max Crusher: Crazy Destruction and Car Crashes is an exciting game in which the player has to become a real wrecking racer. There are many unique cars available in the game, each of which has its own characteristics and capabilities. From classic sports cars to massive monster trucks, you will have complete freedom to choose the vehicle for your crazy adventures.",
        "gameplay": "Control: WASD - Driving. Shift - nitro. R - turn the car over. C - camera change. Esc - call MENU. T - Time dilation. Space - handbrake. Controls for mobile devices: Use the game interface on the screen."
    },
    { 
        "id": 53, 
        "name": "Catch Thief",
        "category": "Puzzle",
        "thumbnail": "https://img.gamedistribution.com/919644af743a4a7a971738bbf2377e83-512x512.jpg", 
        "url": "/assets/pages/player.html?title=Catch Thief&src=https://html5.gamedistribution.com/919644af743a4a7a971738bbf2377e83/?gd_sdk_referrer_url=https://www.example.com/games/{game-path}&ar=16:9&fs=1", 
        "use": "redirect",
        "description":"Catch Thief is an addictive puzzle game where you must outsmart a clever thief and stop his escape. Take control of the police, block every possible path and drive the criminal into a dead end. With each new level the challenge grows, requiring you to plan ahead, think strategically and act quickly. Bright cartoon graphics, fun scenarios and increasing difficulty make Catch Thief a perfect choice for fans of logic games who enjoy testing their skills, attention and reaction speed.",
        "gameplay": "Tap or click on a police officer and then on the dot where you want him to move. Place your heroes wisely to block the thief’s escape routes. Simple controls, colorful visuals and dynamic gameplay make Catch Thief easy and fascinating. Enjoy the game and have fun!"
    },
    { 
        "id": 54, 
        "name": "Manyunya Saving the Princess",
        "category": "Adventure",
        "thumbnail": "https://img.gamedistribution.com/f58b7225d9014346b2a59f08c60700c7-512x512.jpg", 
        "url": "/assets/pages/player.html?title=Manyunya Saving the Princess&src=https://html5.gamedistribution.com/f58b7225d9014346b2a59f08c60700c7/?gd_sdk_referrer_url=https://www.example.com/games/{game-path}&ar=16:9&fs=1", 
        "use": "redirect",
        "description":"Welcome to the time when there were knights, magic, farmers, princesses, and generals. Manyunya sets off at the request of the Supreme Lord to save his princess. On the way you will find a whole dangerous adventure, you will come across colorful views, and characters with whom you can communicate and interact, as well as enemies that you will need to defeat at any cost, and save the princess, and complete the task. Interesting voice acting and story will immerse you in this world with your head!",
        "gameplay": "To control the game, use your computer mouse. If you have a mobile device, use screen tapping. To complete the game, you need to press different buttons indicated on the screen in the game. To defeat the enemy, you need to quickly press the sight."
    },
    { 
        "id": 55, 
        "name": "Monster Escape",
        "category": "Puzzle",
        "thumbnail": "https://img.gamedistribution.com/f93cf32a51c84a39b7d8e8cd1a75ea3b-512x512.jpg", 
        "url": "/assets/pages/player.html?title=Monster Escape&src=https://html5.gamedistribution.com/f93cf32a51c84a39b7d8e8cd1a75ea3b/?gd_sdk_referrer_url=https://www.example.com/games/{game-path}&ar=16:9&fs=1", 
        "use": "redirect",
        "description":"Monster Escape is a thrilling puzzle platformer where you rotate the entire level to help a little green monster grab the key and escape the dark dungeon. Each stage is packed with tricky obstacles — spikes, falling crates, and narrow passages that put your timing and planning skills to the test. The unique mechanic — rotate the world, find the path, unlock the door — creates plenty of satisfying moments as you advance.",
        "gameplay": "Rotate the world using the on-screen buttons to shift gravity and open new paths, then guide the monster to collect the key and reach the locked door to complete the level. On PC, you can also click to the left or right of the monster to make it walk without rotating the stage, while on mobile, smooth touch controls ensure easy navigation. Watch out for spikes and falling boxes, plan your moves wisely, and enjoy the challenge. Good luck!"
    },
    { 
        "id": 56, 
        "name": "Charger City Driver",
        "category": "Racing & Driving",
        "thumbnail": "https://img.gamedistribution.com/3f0aec385266424bb0529dfcecfe30b4-512x512.jpg", 
        "url": "/assets/pages/player.html?title=Charger City Driver&src=https://html5.gamedistribution.com/3f0aec385266424bb0529dfcecfe30b4/?gd_sdk_referrer_url=https://www.example.com/games/{game-path}&ar=16:9&fs=1", 
        "use": "redirect",
        "description":"Get ready to skid the wheels of a stunning muscle car through an expansive night city map! Customize and upgrade your muscle car with cool upgradables and become the best driver in the city. Take your dog with you in 4 driving challenges and conquer the missions together. Use nitro to beat slow traffic and beat all speed, stunt and drift triggers spread across the map. Are you ready to show your driving skills? Prove yourself!",
        "gameplay": "Car: Arrow Keys/W, A, S, D: Drive/Steer/Brake C: Change Camera F: Nitro Character: Arrow Keys/W,A,S,D: Move Mouse Orbit: Look Around."
    }
   


]
